In [1]:
### Importaciones
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
### Lector de archivo
df1 = pd.read_csv("/Users/yairmartinez/Documents/GitHub/Data_analysis_exercises/Extract/DB/Datos/application_record.csv")
df2 = pd.read_csv("/Users/yairmartinez/Documents/GitHub/Data_analysis_exercises/Extract/DB/Datos/credit_record.csv")
print( df1.shape, df2.shape)

(438557, 18) (1048575, 3)

In [3]:
### Data Cleaning

df1.head()

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,1,0,0,0,Security staff,2.0
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0

In [4]:
df2.head()

        ID  MONTHS_BALANCE STATUS
0  5001711               0      X
1  5001711              -1      0
2  5001711              -2      0
3  5001711              -3      0
4  5001712               0      C

In [7]:
#Título de las columnas
list_of_column_names = list(df1.columns)
print('List of column names : ', 
      list_of_column_names)

List of column names :  ['ID', 'CODE_GENDER', 'FLAG_OWN_CAR', 'FLAG_OWN_REALTY', 'CNT_CHILDREN', 'AMT_INCOME_TOTAL', 'NAME_INCOME_TYPE', 'NAME_EDUCATION_TYPE', 'NAME_FAMILY_STATUS', 'NAME_HOUSING_TYPE', 'DAYS_BIRTH', 'DAYS_EMPLOYED', 'FLAG_MOBIL', 'FLAG_WORK_PHONE', 'FLAG_PHONE', 'FLAG_EMAIL', 'OCCUPATION_TYPE', 'CNT_FAM_MEMBERS']

In [ ]:
#DESECHAR COLUMNAS 
df2000=df.drop([2, 3, 4, 5, 6, 7, 11, 12, 13, 14, 15, 16, 17, 18, 19], axis=1, inplace=False)

In [ ]:
#Cambiar título de las columnas 
new_header = df2000.iloc[0] #grab the first row for the header
df2000 = df2000[1:] #take the data less the header row
df2000.columns = new_header #set the header row as the df header

In [ ]:
#Título de las columnas
list_of_column_names = list(df2000.columns)
print('List of column names : ', 
      list_of_column_names)

In [ ]:
df2000.head()

In [ ]:
df2000.shape

In [ ]:
df2000.tail()

In [ ]:
df2000.to_csv(r'/Users/yairmartinez/Documents/GitHub/Data_Analysis/INEGI/Extract/DB/df2000.csv', index=False)

In [ ]:
###2005###

In [ ]:
#DESECHAR COLUMNAS 
df2005=df.drop([2, 3, 4, 5, 6, 7, 8, 9, 10, 14, 15, 16, 17, 18, 19], axis=1, inplace=False)

In [ ]:
#Cambiar título de las columnas 
new_header = df2005.iloc[0] #grab the first row for the header
df2005 = df2005[1:] #take the data less the header row
df2005.columns = new_header #set the header row as the df header

In [ ]:
#Título de las columnas
list_of_column_names = list(df2005.columns)
print('List of column names : ', 
      list_of_column_names)

In [ ]:
df2005.head()

In [ ]:
df2005.shape

In [ ]:
df2005.tail()

In [ ]:
df2005.to_csv(r'/Users/yairmartinez/Documents/GitHub/Data_Analysis/INEGI/Extract/DB/df2005.csv', index=False)

In [ ]:
###2010###

In [ ]:
#DESECHAR COLUMNAS 
df2010=df.drop([2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 17, 18, 19], axis=1, inplace=False)

In [ ]:
#Cambiar título de las columnas 
new_header = df2010.iloc[0] #grab the first row for the header
df2010 = df2010[1:] #take the data less the header row
df2010.columns = new_header #set the header row as the df header

In [ ]:
#Título de las columnas
list_of_column_names = list(df2010.columns)
print('List of column names : ', 
      list_of_column_names)

In [ ]:
df2010.head()

In [ ]:
df2010.shape

In [ ]:
df2010.tail()

In [ ]:
df2010.to_csv(r'/Users/yairmartinez/Documents/GitHub/Data_Analysis/INEGI/Extract/DB/df2010.csv', index=False)

In [ ]:
###2020###

In [ ]:
#DESECHAR COLUMNAS 
df2020=df.drop([2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16], axis=1, inplace=False)

In [ ]:
#Cambiar título de las columnas 
new_header = df2020.iloc[0] #grab the first row for the header
df2020 = df2020[1:] #take the data less the header row
df2020.columns = new_header #set the header row as the df header

In [ ]:
#Título de las columnas
list_of_column_names = list(df2020.columns)
print('List of column names : ', 
      list_of_column_names)

In [ ]:
df2020.head()

In [ ]:
df2020.shape

In [ ]:
df2020.tail()

In [ ]:
df2020.to_csv(r'/Users/yairmartinez/Documents/GitHub/Data_Analysis/INEGI/Extract/DB/df2020.csv', index=False)